app/controllers/facilities_controller.rb

    def set_facility
      @facility = Facility.find(params[:id])
---
SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]