app/controllers/monsters_controller.rb

  def index
    @monsters = Monster.all
---
SELECT "monsters".* FROM "monsters"

  def create
    @monster = Monster.new(monster_params)

    respond_to do |format|
      if @monster.save
---
INSERT INTO "monsters" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-05-28 14:20:09.980690"], ["updated_at", "2019-05-28 14:20:09.980690"]]

  def destroy
    @monster.destroy
---
DELETE FROM "monsters" WHERE "monsters"."id" = ?  [["id", 1]]

    def set_monster
      @monster = Monster.find(params[:id])
---
SELECT  "monsters".* FROM "monsters" WHERE "monsters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]