app/controllers/staffs_controller.rb

    def set_staff
      @staff = Staff.find(params[:id])
---
SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]