app/controllers/staffs_controller.rb

SELECT  "staffs".* FROM "staffs" WHERE "staffs"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
    def set_staff
      @staff = Staff.find(params[:id])